# Explore here

In [47]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split as tts

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/4GeeksAcademy/logistic-regression-project-tutorial/main/bank-marketing-campaign-data.csv', sep=';')

In [3]:
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41188 entries, 0 to 41187
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41188 non-null  int64
 1   job             41188 non-null  object
 2   marital         41188 non-null  object
 3   education       41188 non-null  object
 4   default         41188 non-null  object
 5   housing         41188 non-null  object
 6   loan            41188 non-null  object
 7   contact         41188 non-null  object
 8   month           41188 non-null  object
 9   day_of_week     41188 non-null  object
 10  duration        41188 non-null  int64
 11  campaign        41188 non-null  int64
 12  pdays           41188 non-null  int64
 13  previous        41188 non-null  int64
 14  poutcome        41188 non-null  object
 15  emp.var.rate    41188 non-null  float64
 16  cons.price.idx  41188 non-null  float64
 17  cons.conf.idx   41188 non-null  float64
 18  euribor3m       41188 non-null  float64
 19  nr.employed     41188 non-null  float64
 20  y               41188 non-null  object
dtypes: float64(5), int64(5), object(11)
memory usage: 6.6+ MB

In [5]:
df.default.unique()

array(['no', 'unknown', 'yes'], dtype=object)

In [19]:
df.duplicated().sum()

12

In [ ]:
df = df.drop_duplicates()
df.duplicated().sum()

0

In [25]:
df.isna().sum()

age               0
job               0
marital           0
education         0
default           0
housing           0
loan              0
contact           0
month             0
day_of_week       0
duration          0
campaign          0
pdays             0
previous          0
poutcome          0
emp.var.rate      0
cons.price.idx    0
cons.conf.idx     0
euribor3m         0
nr.employed       0
y                 0
dtype: int64

In [27]:
df.nunique()

age                 78
job                 12
marital              4
education            8
default              3
housing              3
loan                 3
contact              2
month               10
day_of_week          5
duration          1544
campaign            42
pdays               27
previous             8
poutcome             3
emp.var.rate        10
cons.price.idx      26
cons.conf.idx       26
euribor3m          316
nr.employed         11
y                    2
dtype: int64

In [44]:
print(f'''
      default: {df.default.value_counts()},
      housing: {df.housing.value_counts()},
      loan: {df.loan.value_counts()},
      contact: {df.contact.value_counts()},
      previous: {df.previous.value_counts()},
      poutcome: {df.poutcome.value_counts()},
      y: {df.y.value_counts()}
      ''')

      default: default
no         32577
unknown     8596
yes            3
Name: count, dtype: int64,
      housing: housing
yes        21571
no         18615
unknown      990
Name: count, dtype: int64,
      loan: loan
no         33938
yes         6248
unknown      990
Name: count, dtype: int64,
      contact: contact
cellular     26135
telephone    15041
Name: count, dtype: int64,
      previous: previous
0    35551
1     4561
2      754
3      216
4       70
5       18
6        5
7        1
Name: count, dtype: int64,
      poutcome: poutcome
nonexistent    35551
failure         4252
success         1373
Name: count, dtype: int64,
      y: y
no     36537
yes     4639
Name: count, dtype: int64

In [37]:
df.default.value_counts()

default
no         32577
unknown     8596
yes            3
Name: count, dtype: int64

In [49]:
pd.pivot_table(
    df,
    index=['education', 'job'],
    columns=['y'],
    aggfunc='size',
    fill_value=0  # to avoid the 'nan' legend when some value doesn't exists
)

y                         no  yes
education job
basic.4y  admin.          67   10
          blue-collar   2195  123
          entrepreneur   130    7
          housemaid      423   51
          management      95    5
...                      ...  ...
unknown   services       131   19
          student        108   59
          technician     187   25
          unemployed      14    5
          unknown        114   17

[90 rows x 2 columns]

In [ ]:
pivot = pd.pivot_table(
    df,
    index=['education', 'job'],
    columns=['y'],
    aggfunc='size',
    fill_value=0  # to avoid the 'nan' legend when some value doesn't exists
)
# to force the pivot table format with percentajes
pivot_percentage = pivot.div(pivot.sum(axis=1), axis=0) * 100
pivot_percentage.style.format("{:.2f}%")